*In development*
* Overview

=portman= is a package to process your trade data and consolidate it into a summary report.

* Features

1. Simple =.csv= input file.
2. Snapshot of portfolio *core* information.
   1. share holdings (what do you have?).
   2. average purchase price (how much did you pay for it?).
   3. current market price (what is the current price?).
   4. profit and loss on position (how much I'm gaining or losing?).
3. Dashboard visualization of snapshot.
   1. asset class distribution (stocks, etf, reit, crypto, etc).
   2. stocks distribution by sector and ticker.
   3. etf distribution by factor and ticker.

* Workflow

1. Every trade is recorded in a =.csv= file.
   1. you can have multiple =.csv= for you own organizational purpose, I use one for each asset class or to separate currencies.
   2. *need to be in specific format*
2. Process the trades =python -m portman.process <file or list of data files>=
3. Visualize with  =python -m portman.portvis <portfolio.csv>=
   1. =portfolio.csv= is the default output file name
      

* Input
The input is a simple =.csv= file with your transaction history.

#+begin_example
date,type,ticker,shares,price,fee
#+end_example

* Installation

Clone this repository and run =pip install .= in this folder (where =setup.py= is located).

* How to use =portman=?
:PROPERTIES:
:header-args:python: :session demo
:END:
** As a /program/ that acts on an input file
Generates a =.csv= file by calling the =portman.process= module with the trades data,

#+begin_src shell :dir examples/simple
python -m portman.process "trades.csv"
cat portfolio.csv
#+end_src

#+RESULTS:
| ticker | shares | average price ($) | market price ($) |    P/L % | market value ($) | sector                 | name             | currency | asset class |
| AMZN   |     20 |              17.5 |          2302.93 |  13059.6 |          46058.6 | Consumer Cyclical      | Amazon.com, Inc. | USD      | EQUITY      |
| GOOG   |     40 |              6.25 |          2255.98 | 35995.68 |          90239.2 | Communication Services | Alphabet Inc.    | USD      | EQUITY      |

** As a /library/ in a script
Can be used in script form.

#+begin_src python 
import portman.trades
import portman.portfolio

trades = portman.trades.Trades("examples/simple/trades.csv")
porfolio = portman.portfolio.Portfolio(trades)
print(porfolio.summary)
#+end_src

#+RESULTS:
:         shares  average price ($)  market price ($)     P/L %  market value ($)                  sector              name currency asset class
: ticker                                                                                                                                        
: AMZN        20              17.50           2302.93  13059.60           46058.6       Consumer Cyclical  Amazon.com, Inc.      USD      EQUITY
: GOOG        40               6.25           2255.98  35995.68           90239.2  Communication Services     Alphabet Inc.      USD      EQUITY


** Dashboard

After generating the processed portfolio file, we can visualize in a dashboard with

#+begin_src shell :dir examples/two_sources
python -m portman.portvis.dashboard "portfolio.csv"
#+end_src

